# C
l=["network","math","programming","physic","music"]
str='p'                               #اسندنا للمتغير str قيمة p من النوع string لنختبر به العناصر التي تبدأ بهذه القيمة

for i in range(len(l)):               #حلقة تتكرر بطول القائمة
     
     if l[i][0]==str:                  #اختبار الشرط : سوف ياخذ كل عنصر من القائمة وبالتحديد العنصر الاول من عنصر القائمة الاساسي (العنصر هو سلسلة  ثم وضعنا رقم الفهرس للعنصر الاول من السلسلة)
     
         print(l[i])                   # طباعة هذه العناصر بعد تحقق الشرط  
 #############################